keenanjohnson/ota-micropython-esp32-example/board/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "OTA Example"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"

#define MICROPY_PY_BLUETOOTH                (0)
#define MICROPY_PY_MACHINE_DAC              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

// USB device identity. These replace the old CONFIG_TINYUSB_DESC_* sdkconfig
// options, which were removed upstream. The serial number is now derived from
// the MAC address and can no longer be hard-coded.
#define MICROPY_HW_USB_MANUFACTURER_STRING  "Keenan Johnson"
#define MICROPY_HW_USB_PRODUCT_FS_STRING    "OTA Example"

#define MICROPY_HW_I2C0_SCL                 (4)
#define MICROPY_HW_I2C0_SDA                 (3)

#define MICROPY_ENABLE_COMPILER             (1)

#define MICROPY_PY_ESPNOW                   (0)
#define MICROPY_PY_MACHINE_I2S              (0)
#define MICROPY_HW_ENABLE_SDCARD            (0)

#define MICROPY_PY_DEFLATE_COMPRESS         (1)